alessandro-satanassi/OpenFIRE-Firmware-ESP32/lightgun/src/main.cpp
/*!
 * @file main.cpp
 * @brief OpenFIRE Esp32 - 4IR LED Lightgun wireless sketch w/ support for force feedback and other features.
 * Forked from OpenFIRE firmware v6.2 from https://github.com/TeamOpenFIRE/OpenFIRE-Firmware
 * which in itself is forked from IR-GUN4ALL v4.2, which is based on Prow's Enhanced Fork from https://github.com/Prow7/ir-light-gun,
 * which in itself is based on the 4IR Beta "Big Code Update" SAMCO project from https://github.com/samuelballantyne/IR-Light-Gun
 * @n CPP file for Samco Light Gun 4 LED setup
 *
 * @copyright alessandro-satanassi, https://github.com/alessandro-satanassi, 2026
 * @copyright GNU Lesser General Public License
 *
 * @author [Alessandro Satanassi](alessandro@cittini.it)
 * @version V6.2.0 stable
 * @date 2026
 * 
 * I thank you for producing the first original code:
 * 
 * @copyright Samco, https://github.com/samuelballantyne, June 2020
 * @copyright Mike Lynch, July 2021
 * @copyright That One Seong, https://github.com/SeongGino, 2024
 * @copyright GNU Lesser General Public License
 *
 * @author [Sam Ballantyne](samuelballantyne@hotmail.com)
 * @author Mike Lynch
 * @author [That One Seong](SeongsSeongs@gmail.com)
 * @date 2025
 */

#include "OpenFIREmain.h"
#include "boards/OpenFIREshared.h"
#include "OpenFIREcolors.h"
#include "OpenFIRElights.h"
#include "OpenFIREserial.h"
#include "OpenFIREFeedback.h"
#include "OpenFIREprefs.h"
#include "OpenFIREconstant.h"

// #include "web_assets.h"
#include "OpenFIREweb.h"
#include "OpenFIREusbnet.h"

#include "class/net/net_device.h"
extern "C" volatile bool OF_NcmDataInterfaceReady;

#if defined(ARDUINO_ARCH_ESP32) && defined(OPENFIRE_USB_NCM)
    // CDC is created after the boot choice, not by the Arduino core. Route
    // early diagnostics through the same safe stream used by the firmware.
    #undef Serial
    #define Serial (*Serial_OpenFIRE_Stream)
#endif

// ===================================================================================
// OS ABSTRACTION: DELAY REDEFINITION / RIDEFINIZIONE DEL DELAY (FREERTOS)
// ===================================================================================
// By replacing the native blocking function with vTaskDelay, we ensure that
// the FreeRTOS scheduler can yield control to other tasks (e.g., radio or display)
// during wait periods, preventing the entire operating system from stalling.
// /
// Sostituendo la funzione nativa bloccante con vTaskDelay, garantiamo che 
// lo scheduler di FreeRTOS possa cedere il controllo ad altri task (es. radio o display) 
// durante le attese, prevenendo lo stallo dell'intero sistema operativo.
#ifdef ARDUINO_ARCH_ESP32  // [ESP32_PORT]
    #define delay(ms) vTaskDelay(pdMS_TO_TICKS(ms))                    
#endif //ARDUINO_ARCH_ESP32

// ===================================================================================
// DISPLAY RESOURCE SHARING / CONDIVISIONE RISORSE DISPLAY
// ===================================================================================
// By exposing a reference pointer (*&), we allow the Wireless module—isolated
// in other threads—to inject status animations (e.g., "Searching...")
// directly onto the display, bypassing standard firmware encapsulation.
// /
// Esponendo un puntatore reference (*&), permettiamo al modulo Wireless, isolato 
// in altri thread, di iniettare animazioni di stato (es. "Searching...") 
// direttamente sul display, aggirando l'incapsulamento standard del firmware.
// ========== enables wireless module to use the display / serve per usare display da parte wireless =============
#ifdef USES_DISPLAY
    #ifdef USE_LOVYAN_GFX
        LGFX_SSD1306 *&display_OLED  = FW_Common::OLED.display;   //aggiunto inline per condividerla
    #else
        Adafruit_SSD1306 *&display_OLED  = FW_Common::OLED.display; //aggiunto inline per condividerla
    #endif
#endif // USES_DISPLAY
// ========== END enables wireless module to use the display / fine serve per usare display da parte wireless =============


// ===================================================================================
// MULTITHREADING (CORE 1) AND WATCHDOG / MULTITHREADING (CORE 1) E WATCHDOG
// ===================================================================================
// The dual-core setup frees up valuable cycles. However, vTaskDelay(1)
// is architecturally essential: it forces the task to sleep for 1 ms, allowing
// the hidden FreeRTOS Idle task to run. Without this breathing room, the core
// would stall, and the hardware watchdog would reboot the board due to a panic.
// /
// Il setup del dual-core scarica cicli preziosi. Tuttavia, il vTaskDelay(1) 
// è essenziale architettonicamente: costringe il task a dormire 1 ms permettendo 
// al task Idle nascosto di FreeRTOS di girare. Senza questo respiro, il Core si 
// bloccherebbe e l'Hardware Watchdog riavvierebbe la scheda in panic.

// =======[ESP32_PORT]======= DUAL-CORE MANAGEMENT FOR ESP32 USING FREERTOS / GESTIONE DUAL CORE PER ESP32 CHE USA FREERTOS (INIZIALIZZAZIONE)
#if defined(ARDUINO_ARCH_ESP32) && defined(DUAL_CORE)
    void setup1();
    void loop1();
    TaskHandle_t task_loop1;
    void esploop1(void* pvParameters) {
        setup1();
        for (;;) {
            loop1();
            // Blocca questo task per 1 millisecondo (o 1 tick).
            // Questo permette all'Idle Task (priorità 0) di girare, 
            // nutrire il Watchdog e pulire il sistema.
            vTaskDelay(pdMS_TO_TICKS(1));
        }
    }
#endif
// ======[ESP32_PORT]====== DUAL-CORE MANAGEMENT FOR ESP32 USING FREERTOS / FINE GESTIONE DUAL CORE ESP32 (FINE INIZIALIZZAZIONE)

// Buttons to hold at boot (1.5 s) to also serve the App over WiFi (web
// configuration mode). It works with the dongle too: the access point joins
// the channel of the ESP-NOW link. / Tasti da tenere premuti all'avvio (1,5 s)
// per servire l'App anche via WiFi: funziona anche con il dongle, l'access
// point si aggancia al canale del collegamento ESP-NOW.

#define FIRMWARE_COMBO_BUTTON_1 OF_Prefs::pins[OF_Const::btnTrigger]
#define FIRMWARE_COMBO_BUTTON_2 OF_Prefs::pins[OF_Const::btnGunA]

#define WEBCONFIG_COMBO_BUTTON_1 OF_Prefs::pins[OF_Const::btnGunB]
#define WEBCONFIG_COMBO_BUTTON_2 -1

