alessandro-satanassi/OpenFIRE-Firmware-ESP32/lightgun/src/main.cpp
static const uint8_t BOOT_FLAG_NORMAL   = 0b00; // 0
static const uint8_t BOOT_FLAG_FIRMWARE = 0b01; // 1
static const uint8_t BOOT_FLAG_WEBAPP   = 0b10; // 2
// Se sono validi entrambi, il risultato sarà 0b11 (cioè 3)

static uint8_t GetBootModeHeld(const int fwPin1, const int fwPin2, 
                               const int webPin1, const int webPin2, 
                               const unsigned long holdMs)
{
    bool checkFw = (fwPin1 >= 0 || fwPin2 >= 0);
    bool checkWeb = (webPin1 >= 0 || webPin2 >= 0);

    if (!checkFw && !checkWeb) return BOOT_FLAG_NORMAL;

    delay(50);
    const unsigned long holdStart = millis();

    while ((millis() - holdStart) < holdMs) {
        
        if (checkFw) {
            if ((fwPin1 >= 0 && digitalRead(fwPin1) != LOW) || 
                (fwPin2 >= 0 && digitalRead(fwPin2) != LOW)) {
                checkFw = false;
            }
        }

        if (checkWeb) {
            if ((webPin1 >= 0 && digitalRead(webPin1) != LOW) || 
                (webPin2 >= 0 && digitalRead(webPin2) != LOW)) {
                checkWeb = false;
            }
        }

        if (!checkFw && !checkWeb) return BOOT_FLAG_NORMAL;

        delay(10);
    }

    // --- LA NOVITÀ È QUI ---
    // Invece di decidere chi vince, combiniamo i risultati
    uint8_t result = BOOT_FLAG_NORMAL;
    
    if (checkFw)  result |= BOOT_FLAG_FIRMWARE; // Aggiunge il flag Firmware
    if (checkWeb) result |= BOOT_FLAG_WEBAPP;   // Aggiunge il flag WebApp
    
    // Ritorna lo stato puro: può essere 0 (nessuno), 1 (FW), 2 (Web) o 3 (Entrambi)
    return result; 
}

static void CheckBootRequests()
{
    uint8_t bootResult = GetBootModeHeld(
        FIRMWARE_COMBO_BUTTON_1, FIRMWARE_COMBO_BUTTON_2,
        WEBCONFIG_COMBO_BUTTON_1, WEBCONFIG_COMBO_BUTTON_2,
        1500UL
    );

    // Esempio 1: Gestione se li preme entrambi
    /*
    if ((bootResult & BOOT_FLAG_FIRMWARE) && (bootResult & BOOT_FLAG_WEBAPP)) {
        // Ha tenuto premuto tutto! Fai lampeggiare i led di errore o scegli un 3° avvio
    }
    */

    // Esempio 2 (Quello che chiedevi): Precedenza stabilita dall'ordine degli if
    // Se metti prima FIRMWARE, vince Firmware. 
    // Se un domani vuoi dare precedenza alla WEBAPP, ti basta invertire questi due blocchi!
    if (bootResult & BOOT_FLAG_FIRMWARE) {
        FW_Common::RebootToBootloader();
    } 
    else if (bootResult & BOOT_FLAG_WEBAPP) {
        OF_WebConfigModeActive = true;
        //AvviaConfiguratoreWebApp();
    }
}

/*
/// @brief True when both buttons are held, uninterrupted, for holdMs at boot.
static bool BootButtonsHeld(const int firstPin, const int secondPin, const unsigned long holdMs)
{
    // Both buttons must be configured on different GPIOs.
    if(firstPin < 0 || secondPin < 0 || firstPin == secondPin)
        return false;

    // Allow mechanical contacts to settle before the first reading.
    delay(50);

    // Buttons use INPUT_PULLUP: LOW means pressed.
    if(digitalRead(firstPin) != LOW ||
       digitalRead(secondPin) != LOW)
        return false;

    const unsigned long holdStart = millis();

    // Both buttons must remain continuously pressed for the whole interval.
    while((millis() - holdStart) < holdMs) {
        if(digitalRead(firstPin) != LOW ||
           digitalRead(secondPin) != LOW)
            return false;

        delay(10);
    }

    // Perform one final reading at the end of the hold interval.
    return digitalRead(firstPin) == LOW &&
           digitalRead(secondPin) == LOW;
}

static void CheckFirmwareUpdateRequest()
{
    if(BootButtonsHeld(OF_Prefs::pins[OF_Const::btnTrigger],
                       OF_Prefs::pins[OF_Const::btnGunA], 1500UL))
        FW_Common::RebootToBootloader();
}
*/

/// @brief Web configuration mode, requested at boot with the buttons above.
///        Not used yet: OF_WebConfigModeActive is still set by hand below.
/// /      Non ancora usata: OF_WebConfigModeActive si imposta ancora a mano.
/*
static bool CheckWebConfigRequest()
{
    return BootButtonsHeld(OF_Prefs::pins[WEBCONFIG_COMBO_BUTTON_1],
                           OF_Prefs::pins[WEBCONFIG_COMBO_BUTTON_2], 1500UL);
}
*/

// Sets up the environment
void setup() {

    #if defined(ARDUINO_ARCH_ESP32) && defined(OPENFIRE_USB_NCM)
        Serial_OpenFIRE_Stream = &OpenFIREUsbSerial();
    #endif

    // Temporary source for the saved camera setting. Replace only the RHS with
    // the value loaded by the App/configuration layer. A camera change always reboots.
    /*
    const CameraModel selectedCamera = CameraModel::PixArt_PAJ7025R2;
    FW_Common::CameraSelect(selectedCamera);
    */
    //const CameraModel selectedCamera = CAMERA_DEFAULT; //OF_Const::PixArt_PAJ7025R2;
    //FW_Common::CameraSelect(selectedCamera);

    // ======== [ESP32_PORT] =========== X AVVIO DUAL CORE ESP32 =================================== 
    #if defined(ARDUINO_ARCH_ESP32) && defined(DUAL_CORE)
        #define STACK_SIZE_SECOND_CORE 4096 // stack size
        #define PRIORITY_SECOND_CORE 1      // priority task
        xTaskCreatePinnedToCore(
        esploop1,                           // Task function
        "loop1",                            // name of task
        STACK_SIZE_SECOND_CORE,             // Stack size of task
        NULL,                               // parameter of the task
        PRIORITY_SECOND_CORE,               // priority of the task
        &task_loop1,                        // Task handle to keep track of created task
        !ARDUINO_RUNNING_CORE);             // pin task to core 0
    #endif
    // ======= [ESP32_PORT] ========= FINE X AVVIO DUAL CORE ESP32 =================================

    // ===================================================================================
    // HARDWARE FAILSAFES (I2C & ADC)
    // ===================================================================================
    // The physical stability of various hardware (Arduino clones, long wiring) is unpredictable. 
    // I2C timeouts prevent infinite bus hangs. GPIO pins held high
    // compensate for known quirks of specific boards (e.g., stabilizing the Pico's LDO).
    // /
    // La stabilità fisica dell'hardware vario (cloni Arduino, cablaggi lunghi) è imprevedibile.
    // I timeout I2C prevengono blocchi infiniti del bus. I pin GPIO tenuti alti 
    // compensano quirk noti di board specifiche (es. stabilizzare l'LDO del Pico).

    // In case some I2C devices deadlock the program
    // (can happen due to bad pin mappings)
    
    Wire.setTimeout(100);
    Wire1.setTimeout(100);
    
  
    #ifdef ARDUINO_ADAFRUIT_ITSYBITSY_RP2040
        // SAMCO 1.1 needs Pin 5 normally HIGH for the camera
        pinMode(14, OUTPUT);
        digitalWrite(14, HIGH);
    #endif // ARDUINO_ADAFRUIT_ITSYBITSY_RP2040
    #ifdef ARDUINO_RASPBERRY_PI_PICO
        // Pull switching regulator pin high to stabilize reads from ADC (analog pins)
        pinMode(23, OUTPUT);
        digitalWrite(23, HIGH);
    #endif

    // ===================================================================================
    // ADC HARDWARE OVERRIDE (Prevents future bugs if library defaults change) / FORZATURA HARDWARE ADC (Previene futuri bug se cambiano i default di libreria)
    // ===================================================================================
    #if defined(ARDUINO_ARCH_ESP32) && defined(USES_ANALOG)
        
        // Sets the ADC to 12-bit (0-4095 scale). 
        // Vital: all constants (e.g., center at 2048) and formulas depend on this. 
        // /
        // Fissa l'ADC a 12-bit (scala 0-4095). 
        // Vitale: tutte le costanti (es. centro a 2048) e le formule dipendono da questo.
        analogReadResolution(12); 
    
        // Fissa l'attenuazione a 11dB (misura fino a ~3.1V).
        // Vitale: impedisce che l'ADC saturi a tensioni basse, garantendo
        // l'escursione totale del joystick e la corretta lettura del TMP36.
        analogSetAttenuation(ADC_11db);
        
    #endif // defined(ARDUINO_ARCH_ESP32) && defined(USES_ANALOG)


    // ===================================================================================
    // DATA INTEGRITY & PROFILING / DATA INTEGRITY & PROFILAZIONE
    // ===================================================================================
    // A corrupted EEPROM (or file system) can load impossible offset values,
    // breaking the IR tracking calculations. This block acts as a "sanitizer,"
    // forcing a fallback to safe values ​​before causing the software to crash.
    // /
    // Una EEPROM (o File System) corrotta può caricare valori di offset impossibili, 
    // distruggendo la matematica del tracking IR. Questo blocco agisce come "Sanitizer", 
    // forzando il fallback a valori sicuri prima che il software possa crashare.

    // Init pins array, and OFPresets for later load ops
    OF_Prefs::LoadPresets();
    
