alessandro-satanassi/OpenFIRE-Firmware-ESP32/lightgun/src/main.cpp
#endif //USE_TINYUSB

// ====== [ESP32_PORT] ==== initialize camera before the connection / questo blocco per opportunità è spostato sopra prima della connessione =======

    // this is needed for both customs and builtins, as defaults are all uninitialized
    FW_Common::UpdateBindings(true);

    /*FW_Common::FeedbackSet();*/
    // Initialize DFRobot Camera Wires & Object
    //const CameraModel selectedCamera = CAMERA_DEFAULT; //OF_Const::PixArt_PAJ7025R2;
    /////////////////////OF_Prefs::settings[OF_Const::cameraModel] = CAMERA_DEFAULT;
    FW_Common::CameraSet();

    // initialize buttons & feedback devices
    FW_Common::buttons.Begin();
    FW_Common::FeedbackSet();

    #ifdef LED_ENABLE
        OF_RGB::LedInit();
    #endif // LED_ENABLE
// ====== [ESP32_PORT] ==== End initialize camera before the connection / fine del blocco che per opportunità è spostato sopra prima della connessione =======

//CheckFirmwareUpdateRequest();
CheckBootRequests();
#if defined(ARDUINO_ARCH_ESP32) && defined(OPENFIRE_USB_NCM)
    // Boot choice is final: compose HID + CDC or HID + NCM, then enumerate.
    // USB can enumerate while the existing analog calibration takes place.
    OpenFIREUsbBegin(OF_WebConfigModeActive, POLL_RATE);
    Serial_OpenFIRE_Stream = &OpenFIREUsbSerial();
#endif
//OF_WebConfigModeActive = true;
//OF_WebConfigModeActive = false;

// Here the buttons are still held: the web configuration mode will be asked for
// at this point. / Qui i tasti sono ancora premuti: la modalita' di
// configurazione web verra' richiesta da qui.
// const bool webConfigRequested = CheckWebConfigRequest();

// ===================================================================================
// EMPIRICAL HARDWARE CALIBRATION OF ANALOG STICKS / CALIBRAZIONE EMPIRICA HARDWARE DEGLI STICK ANALOGICI
// ===================================================================================
// Instead of relying on hardcoded deadzone values ​​(which vary due to potentiometer
// wear, mechanical spring issues, or manufacturing tolerances), we pause the system
// for 2 seconds at startup. We physically record the background "noise" of the stick
// at rest to dynamically establish a center point and custom safety limits.
// /
// Invece di affidarci a valori di deadzone hardcodati (che variano per usura 
// dei potenziometri, molla meccanica o tolleranze di fabbrica), blocchiamo il sistema 
// per 2 secondi all'avvio. Registriamo fisicamente il "rumore" di fondo dello stick 
// a riposo per stabilire un centro e limiti di sicurezza personalizzati dinamicamente.

    // ===================================================================================
    // [ESP32_PORT] == CODE TO CALIBRATE STICK TO CENTER POSITION / CODICE PER CALIBRARE LEVETTA STICK IN POSIZIONE CENTRALE =============
    // ===================================================================================
    #if defined(ARDUINO_ARCH_ESP32) && defined(USES_ANALOG)   // perform only for ESP32; leave RP2040 using original handling / la facciamo solo per ESP32 e lasciamo RP2040 come gestione originale

    // ======== perform calibration only if the analog stick is configured on GPIOs / fai la calibrazione solo se lo stick analogico è configurato nei gpio
    if(OF_Prefs::pins[OF_Const::analogX] >= 0 && OF_Prefs::pins[OF_Const::analogY] >= 0 &&
           OF_Prefs::pins[OF_Const::analogX] != OF_Prefs::pins[OF_Const::analogY]) {

    #ifdef USES_DISPLAY
        unsigned long lastChange = 0;
        int8_t currentIndex = 0;
        int8_t direzione = 1;
        const char* word = "...CALIBRATION...";
        const uint8_t baseX = 10;
        const uint8_t baseY = 2;
        const uint8_t charWidth = 6;
        uint8_t len_word;
    if(display_OLED != nullptr) {    
        display_OLED->setCursor(baseX, baseY);
        display_OLED->setTextSize(1);
        display_OLED->setTextColor(WHITE, BLACK);
        display_OLED->fillRect(0, 0, 128, 16, BLACK);
        display_OLED->drawFastHLine(0, 15, 128, WHITE);
        display_OLED->print(word);
        display_OLED->display();
        len_word=strlen(word);
    }
    #endif // USES_DISPLAY
    
    uint16_t analogValueX;
    uint16_t analogValueY;
       
    unsigned long startTime = millis();
    while ((millis()-startTime) < 2000) // 2000
    {
        analogValueX = analogRead(OF_Prefs::pins[OF_Const::analogX]);
        analogValueY = analogRead(OF_Prefs::pins[OF_Const::analogY]);
        if (analogValueX > ANALOG_STICK_DEADZONE_X_MAX) ANALOG_STICK_DEADZONE_X_MAX = analogValueX;
        if (analogValueX < ANALOG_STICK_DEADZONE_X_MIN) ANALOG_STICK_DEADZONE_X_MIN = analogValueX;
        if (analogValueY > ANALOG_STICK_DEADZONE_Y_MAX) ANALOG_STICK_DEADZONE_Y_MAX = analogValueY;
        if (analogValueY < ANALOG_STICK_DEADZONE_Y_MIN) ANALOG_STICK_DEADZONE_Y_MIN = analogValueY;

        #ifdef USES_DISPLAY
        if(display_OLED != nullptr) {
            if (millis() - lastChange > 50) {
                display_OLED->setTextColor(BLACK, BLACK);
                display_OLED->setCursor(baseX + (currentIndex * charWidth), baseY);
                display_OLED->write(word[currentIndex]);
                if ((currentIndex > 0) && (currentIndex < (len_word-1)))  {
                    display_OLED->setCursor(baseX + ((currentIndex-direzione) * charWidth), baseY);
                    display_OLED->setTextColor(WHITE, BLACK); 
                    display_OLED->write(word[currentIndex-direzione]);
                }
                display_OLED->display();
                currentIndex = currentIndex + direzione;
                if ((currentIndex == (len_word-1)) || (currentIndex == 0)) direzione *= -1;
                lastChange = millis();
            }
        }
        #endif // USES_DISPLAY
    }
    #ifdef USES_DISPLAY
        FW_Common::OLED.TopPanelUpdate(" CALIBRATION READY "); 
    #endif //USES_DISPLAY

    // ===================================================================================
    // CALCULATE MECHANICAL CENTER / CALCOLO DEL CENTRO MECCANICO PURO
    // ===================================================================================
    // The center must be calculated NOW, based solely on raw spring noise.
    // /
    // Il centro va calcolato ORA, basandosi solo sul rumore grezzo della molla.

