alessandro-satanassi/OpenFIRE-Firmware-ESP32/lightgun/src/main.cpp
    }  
    #if defined(ARDUINO_ARCH_ESP32) && defined(OPENFIRE_WIRELESS_ENABLE)
    else {     
        if (!lastDongleSave || 
            (lastDongleSave && (!(memcmp(lastDongleAddress, peerAddress,6) == 0) || !(lastDongleChannel == espnow_wifi_channel)))) OF_Prefs::SaveLastDongleWireless(peerAddress, &espnow_wifi_channel);
        
        // Close any USB-related items if they need to be closed
        // Preserves memory and prevents USB core errors when not physically connected.
        // /
        // CHIUDI TUTTO CIO' CHE E' USB SE E' DA CHIUDERE
        // Salvaguarda la memoria e previene errori del core USB quando non è connesso fisicamente.
        #if defined(OPENFIRE_USB_NCM)
            OpenFIREUsbDetach(); // Do not rewrite descriptors while USB is running.
        #else
            TinyUSBDevice.clearConfiguration();
            TinyUSBDevice.detach();
        #endif
        
        Serial_OpenFIRE_Stream = &SerialWireless;

        // ===== WIRELESS PEDAL MANAGEMENT / GESTIONE DEL PEDALE WIRELESS =====
        if((OF_Prefs::pins[OF_Const::btnPedal] == -1) && (OF_Prefs::pins[OF_Const::btnPedal2] == -1)) {
            if (lastPedalSave && (lastPedalChannel == espnow_wifi_channel)) {
                if (!SerialWireless.connection_gun_at_last_pedal()) SerialWireless.connection_gun_at_pedal();
            } else SerialWireless.connection_gun_at_pedal();
        }
        else {
            // sends a signal to the dongle indicating that the PEDAL procedure is complete / invia segnale al dongle che la procedura del PEDAL è completa
              SerialWireless.tx_gun_at_dongle_pedal_ready();
        }
        
        // Saves the last connected pedal. / salva l'ultimo pedale connesso
        if (TinyUSBDevices.is_pedal_wireless && (!lastPedalSave || 
            (lastPedalSave && (!(memcmp(lastPedalAddress, peerAddress_pedal,6) == 0) || !(lastPedalChannel == espnow_wifi_channel))))) OF_Prefs::SaveLastPedalWireless(peerAddress_pedal, &espnow_wifi_channel);
  
        // ===== END WIRELESS PEDAL MANAGEMENT / FINE GESTIONE DEL PEDALE =====

    }
    #endif

    // ===================================================================================
    // === [ESP32_PORT] === END USB initialization or wireless connection setup / FINE NUOVA GESTIONE INIZIALIZZAIZONE USB O CONNESSIONE WIRELESS
    // ===================================================================================
    #endif
#endif //USE_TINYUSB

    // Restores the top part of the display to its original state. / ripristina la parte superiore del diplay come in originale
    #ifdef ARDUINO_ARCH_ESP32
    #ifdef USES_DISPLAY
        FW_Common::OLED.ScreenModeChange(ExtDisplay::ScreenMode_e::Screen_None);
    #endif // USES_DISPLAY
    #endif //ARDUINO_ARCH_ESP32


    // ================== avvia webapp ======================
    // Web configuration mode (access point + WebSocket). Set by hand for now;
    // later: OF_WebConfigModeActive = webConfigRequested (buttons held at boot).
    // It works both on the cable and with the dongle: WebApp_Init() uses a fixed
    // channel when the radio is free, and the channel of the ESP-NOW link (dongle
    // or wireless pedal) when that link is already using it.
    // /
    // Modalita' di configurazione web (access point + WebSocket). Per ora si
    // imposta a mano; in seguito: OF_WebConfigModeActive = webConfigRequested
    // (tasti premuti all'avvio). Funziona sia via cavo sia con il dongle:
    // WebApp_Init() usa un canale fisso quando la radio e' libera e il canale del
    // collegamento ESP-NOW (dongle o pedale wireless) quando e' gia' in uso.
    //OF_WebConfigModeActive = true;
    ///////////////////if (OF_WebConfigModeActive) WebApp_Init();
    /*
    if (OF_WebConfigModeActive) {
        WebApp_Init();


    }
    */
    
    // ================== avvia webapp ======================
    if (OF_WebConfigModeActive) {
        WebApp_Init();

        // --- INIZIO BLOCCO ATTESA WINDOWS ---
        if (TinyUSBDevice.mounted()) {
            // Blocca l'esecuzione finché Windows non carica il driver usbncm.sys 
            // e non apre i canali di comunicazione dati (SET_INTERFACE 1)
            while (!OF_NcmDataInterfaceReady) {
                delay(10); // Il delay è vitale per far lavorare in background il task USB!
            }
            
            // Windows è pronto. Diamogli 1 secondo per finire di stabilizzarsi internamente.
            delay(1000); 
            
            // Inviamo a Windows il segnale per svegliare la scheda (finto stacca-attacca)
            tud_network_link_state(0, false);
            delay(50);
            tud_network_link_state(0, true);
        }
        // --- FINE BLOCCO ATTESA WINDOWS ---
    }
    // ======================================================
    
    // ======================================================


// ===================================================================================
// POLYMORPHIC I/O: THE VIRTUAL SERIAL PORT TRICK / IL TRUCCO DELLA SERIALE VIRTUALE
// ===================================================================================
// Architecture for backward compatibility. By redefining the `Serial` macro
// to point to our dereferenced stream (*Serial_OpenFIRE_Stream), the entire
// legacy codebase (originally designed for wired USB) can use `Serial.print`
// and `Serial.write` as usual. Data will be routed via cable or network
// (ESP-NOW) depending on the outcome of the prior negotiation.
// /
// Architettura per retrocompatibilità. Ridefinendo la macro `Serial` per 
// puntare al nostro stream dereferenziato (*Serial_OpenFIRE_Stream), l'intera codebase 
// legacy (nata per USB wired) può usare `Serial.print` e `Serial.write` come sempre. 
// I dati verranno instradati via Cavo o via Rete (ESP-NOW) a seconda 
// dell'esito della negoziazione precedente.

    // ===================================================================================
    // === [ESP32_PORT] ===
    // ===================================================================================
    
    #ifdef OPENFIRE_WIRELESS_ENABLE
        #ifdef Serial
            #undef Serial
        #endif
        #define Serial (*Serial_OpenFIRE_Stream)
    #endif // OPENFIRE_WIRELESS_ENABLE
    
    // ===================================================================================
    // === [ESP32_PORT] ===
    // ===================================================================================


    // AbsMouse5.init(true); // [ESP32_PORT] removed for the new OpenFire_TinyDevice / rimosso per il mio nuovo OpenFire_TinyDevice

    // IR camera maxes out motion detection at ~300Hz, and millis() isn't good enough

    // Wireless operation introduces overhead. Reducing the IR camera tick rate
    // when on battery (from 5ms to ~15ms) frees up CPU for ESP-NOW, limiting potential system lag; however,
    // I found it works well even at the same frequency used for the wired connection,
    // so I set it to the same value—209Hz, corresponding to approximately 5ms.
    // /
    // L'esecuzione wireless introduce overhead. Ridurre il tick rate della telecamera IR 
    // su batteria (da 5ms a ~15ms) offre più CPU all'ESP-NOW limitando possibili lag di sistema, ma
    // ho riscontrato che funziona comunque bene alla stessa frequenza usata con connessione via cavo,
    // quindi l'ho impostata uguale ovvero 209Hz che corrisponde a circa 5ms
    if (TinyUSBDevices.onBattery) startIrCamTimer(OpenFIRECamera::Profile().fps);  // set to 5ms for wireless too... e.g., 100->10ms, 66->15ms for wireless connection / impostato a 5ms anche per wireless ... es. 100->10ms 66 -> 15ms per connessione wireless
      else startIrCamTimer(OpenFIRECamera::Profile().fps); // 5ms for wired connection / 5ms per connessione via cavo
    
